blog-posts/2004-07-12-funny-lisp-cooking.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Funny Lisp cooking</title>
<!-- 2015-01-07 Wed 14:52 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" type="text/css" href="../css/foundation.min.css"></link>
<link href='http://fonts.googleapis.com/css?family=Open+Sans' rel='stylesheet' type='text/css'></link>
<link rel="stylesheet" type="text/css" href="../css/org-export.css"></link>
<link rel="stylesheet" type="text/css" href="../css/style.css"></link>
<link rel="stylesheet" type="text/css" href="../css/emacs-notes.css"></link>
</head>
<body>
<div id="content">
<h1 class="title">Funny Lisp cooking</h1>
<p>
July 12th, 2004 -
<a href="http://sachachua.com/blog/p/2180"><a href="http://sachachua.com/blog/p/2180">http://sachachua.com/blog/p/2180</a></a>
</p>

<p>
<a href="http://www.emacswiki.org/cgi-bin/utis/2004-07-04"><a href="http://www.emacswiki.org/cgi-bin/utis/2004-07-04">http://www.emacswiki.org/cgi-bin/utis/2004-07-04</a></a>
</p>

<pre class="example">
(defun make-arugolo-risotto ()
  "Return a pot of risotto with arugola."
  (interactive)
  (let ((onions (chop (get-onions) 'fine))
        (rice (get-rice))
        (wine (get-wine))
        (butter (get-butter))
        (stock (get-stock 'vegetable))
        (cheese (rasp (get-cheese 'parmesan)))
        (pot (get-pot 'large))
        (vegetable (chop (wash (get-vegetable 'arugola))
                         'medium)))
    (setq pot (heat-pot pot 'medium))
    (with-current-pot pot
      (add butter)
      (add onions)
      (while (not-glassy-p onions) ; FIXME
        ;; not-glassy-p probably returns t too late in the process.
        (stir pot))
      (add rice)
      (while (not (covered-with-butter-p rice)) ; FIXME
        (stir pot))
      (add wine)
      (while (liquidity-not-absorbed-p rice)
        (stir pot))
      (finish-risotto pot rice stock)
      (add vegetable)
      (add cheese)
      pot)))

(defun finish-risotto (pot rice stock)
  (with-current-pot pot
    (while (not (rice-ready-p rice))
      (add stock)
      (while (liquidity-not-absorbed-p rice)
        (stir pot))))
</pre>
</div>
<div id="postamble" class="status">
<div class="back-to-top"><a href="#top">Back to top</a> | <a href="mailto:sacha@sachachua.com">E-mail me</a></div>
</div>
</body>
</html>
